Repository: Nour2529/MyPortfolioApp
Catalog: MyPortfolioApp/lib/config/l10n/app_*.arb
Languages: ar, fr

# aboutDescription
source: I am a skilled student in computer science and web and mobile programming. I am also interested in IoT. Moreover, I always accept new challenges.
ar: أنا طالبة ماهرة في علوم الحاسوب وبرمجة الويب والجوال. كما أنني مهتمة أيضًا بالإنترنت الأشياء. بالإضافة إلى ذلك، أنا دائمًا مستعدة لتحديات جديدة.
fr: Je suis une étudiante douée en informatique et en programmation web et mobile. Je m'intéresse également à l'IoT. De plus, j'accepte toujours les nouveaux défis.

source: About Me
ar: عني
fr: À propos de moi

# aboutMeTitle
source: Hello, I'm Feki Nour
ar: مرحبًا، أنا فكي نور
fr: Bonjour, je suis Feki Nour

source: Contact
ar: اتصال

# contactAddress
source: Sfax, Tunisia
ar: صفاقس، تونس
fr: Sfax,Tunisie

# contactComment
source: Comment
ar: تعليق
fr: Commentaire

# contactCommentHint
source: Type a comment
ar: اكتب تعليقًا
fr: Tapez un commentaire

# contactDescription
source: I am open to your suggestions and eager to receive your feedback.
ar: أنا متاحة لاقتراحاتكم وأتطلع بشغف إلى استقبال ملاحظاتكم.
fr: Je suis ouverte à vos suggestions et impatiente de recevoir vos retours.

# contactEmail
source: Email
ar: البريد الإلكتروني

# contactEmailHint
source: Email address
ar: عنوان البريد الإلكتروني
fr: Adresse e-mail

# contactEmptyFormError
source: Please enter your {label}.
ar: الرجاء إدخال {label} الخاص بك.
fr: Veuillez entrer votre {label}.

# contactInfoDescription
source: You can access my contact information on this page. Additionally, links to my social media profiles are available at the top of the page to allow you to contact me on these platforms if you wish.
ar: يمكنك الوصول إلى معلومات الاتصال بي على هذه الصفحة. بالإضافة إلى ذلك، تتوفر روابط إلى ملفاتي الشخصية على وسائل التواصل الاجتماعي في أعلى الصفحة لتمكينك من الاتصال بي على هذه المنصات إذا كنت ترغب في ذلك.
fr: Vous pouvez accéder à mes coordonnées sur cette page. De plus, les liens vers mes profils sur les réseaux sociaux sont disponibles en haut de la page pour vous permettre de me contacter sur ces plateformes si vous le souhaitez.

# contactInfoTitle
source: Contact and Social Media
ar: الاتصال ووسائل التواصل الاجتماعي
fr: Contact et Réseaux Sociaux

# contactInvalidEmailFormError
source: Please enter a valid email address.
ar: يرجى إدخال عنوان بريد إلكتروني صالح.
fr: Veuillez saisir une adresse e-mail valide.

# contactMeButton
source: Send
ar: إرسال
fr: Envoyer

# contactName
source: Name
ar: الاسم
fr: Nom

# contactNameHint
source: Full name
ar: الاسم الكامل
fr: Nom complet

# contactSendEmailTitle
source: Contact
ar: اتصال

# contactSendMessageFailureTitle
source: Failed to send message, please try again.
ar: فشل في إرسال الرسالة، يرجى المحاولة مرة أخرى.
fr: Échec de l'envoi du message, veuillez réessayer.

# contactSendMessageSuccessTitle
source: Message sent successfully.
ar: تم إرسال الرسالة بنجاح.
fr: Message envoyé avec succès.

# contactSubject
source: Subject
ar: الموضوع
fr: Sujet

# contactTitle
source: Get in Touch
ar: التواصل
fr: Entrer en contact

source: Desktop Development
ar: تطوير سطح المكتب
fr: Développement de bureau

# desktopDevelopmentDescription
source: As a desktop developer, I create feature-rich applications that work on various operating systems. Whether it's standalone or enterprise software, I design and build applications to meet your specific needs.
ar: بصفتي مطورًا لسطح المكتب، أقوم بإنشاء تطبيقات غنية بالميزات تعمل على مختلف أنظمة التشغيل. سواء كان الأمر يتعلق ببرمجيات مستقلة أو مؤسسية، أصمم وأبني تطبيقات لتلبية احتياجاتك الخاصة.
fr: En tant que développeur de bureau, je crée des applications riches en fonctionnalités qui fonctionnent sur divers systèmes d'exploitation. Qu'il s'agisse de logiciels autonomes ou d'entreprise, je conçois et construis des applications pour répondre à vos besoins spécifiques.

source: Download Resume
ar: تحميل السيرة الذاتية
fr: Télécharger le CV

source: Hire Me
ar: توظيف
fr: Contactez-moi

source: Home
ar: الرئيسية
fr: Accueil

# homeJobTitle
source: Student in Software Engineering and Business Intelligence
ar: طالبة في هندسة البرمجيات والذكاء الاصطناعي
fr: Étudiante en génie logiciel et informatique décisionnel

# homeWelcome
source: Welcome, I'm
ar: مرحبًا، أنا
fr: Bienvenue, je suis

# jobTitle
source: Student in Software Engineering and Business Intelligence
ar: طالبة في هندسة البرمجيات والذكاء الاصطناعي
fr: Étudiante en génie logiciel et informatique décisionnel

# languageNameEnglish
source: English
ar: الإنجليزية
fr: Anglais

# languageNamePersian
source: Persian
ar: الفارسية
fr: Persan

# languageNameFrench
source: French
ar: الفرنسية
fr: Français

# languageNameArab
source: Arabic
ar: العربية
fr: Arab

# languageNameGermany
source: German
ar: الألمانية
fr: Allemand

source: Language Skills
ar: مهارات اللغة
fr: Compétences linguistiques

# languageSkillsDescription
source: One of my passions is studying and learning languages. I strive to be able to learn and use my favorite languages.
ar: إحدى شغفي هو دراسة وتعلم اللغات. أسعى لأن أتمكن من تعلم واستخدام لغاتي المفضلة.
fr: L'une de mes passions est d'étudier et d'apprendre des langues. J'essaie de pouvoir apprendre et utiliser mes langues préférées.

source: Mobile Development
ar: تطوير الجوال
fr: Développement mobile

# mobileDevelopmentDescription
source: With expertise in mobile development, I can create user-friendly applications for iOS and Android. Whether native or cross-platform, I develop applications optimized for performance, security, and scalability.
ar: بفضل خبرتي في تطوير التطبيقات الجوالة، يمكنني إنشاء تطبيقات سهلة الاستخدام لنظامي iOS وAndroid. سواء كانت تطبيقات أصلية أو متعددة المنصات، أقوم بتطوير تطبيقات محسنة للأداء والأمان والقابلية للتوسع.
fr: Avec une expertise en développement mobile, je peux créer des applications conviviales pour iOS et Android. Qu'il s'agisse de natif ou de multiplateforme, je développe des applications optimisées pour les performances, la sécurité et la scalabilité.

# myName
source: Feki Nour
ar: نور الفقي

# projects
source: My projects
ar: مشاريعي
fr: Mes projets

source: Skills
ar: المهارات
fr: Compétences

# skillsDescription
source: I am passionate about computer science and new technologies, and I have acquired strong skills through my education.
ar: أنا متحمسة لمجال علوم الحاسوب والتكنولوجيا الجديدة، وقد اكتسبت مهارات قوية من خلال تعليمي.
fr: Je suis passionnée par le domaine informatique et les nouvelles technologies, et j'ai acquis des compétences solides au fil de ma formation.

# electroShopProject
source: Electro shop
ar: متجر الكتروني

# electroShopProjectDescription
source: Design and implementation of a dynamic website, an e-commerce website for selling computer equipment. Keywords: HTML - CSS - Bootstrap - JavaScript - PHP
ar: تصميم وتنفيذ موقع ويب ديناميكي، موقع ويب للتجارة الإلكترونية لبيع معدات الكمبيوتر. الكلمات الرئيسية: HTML - CSS - Bootstrap - JavaScript - PHP
fr: Conception et réalisation d’un site web dynamique, site web e-commerce pour la vente des équipements informatique. Mots cles : HTML - CSS - Bootstrap - JAVASCRIPT -PHP

# bouticoProject
source: Boutico
ar: بوتيكو

# bouticoProjectDescription
source: Design and implementation of a dynamic website, an e-commerce website for selling clothes. Keywords: Laravel - Vue.js - Bootstrap
ar: تصميم وتنفيذ موقع ويب ديناميكي، موقع ويب للتجارة الإلكترونية لبيع الملابس. الكلمات الرئيسية: Laravel - Vue.js - Bootstrap
fr: Conception et réalisation d’un site web dynamique, site web e-commerce pour la vente des vêtements. Mots cles : Laravel - VueJS - Bootstrap

# myUniversityProject
source: MyUniversity
ar: جامعتي

# myUniversityProjectDescription
source: Design and implementation of a dynamic website for student management, including integration of Firebase for authentication. Keywords: Angular - Firebase - Angular Material.
ar: تصميم وتنفيذ موقع ويب ديناميكي لإدارة الطلاب، بما في ذلك دمج Firebase للمصادقة. الكلمات الرئيسية: Angular - Firebase - Angular Material.
fr: Conception et réalisation d’un site web dynamique pour la gestion des étudiants, incluant l’intégration de Firebase pour l’authentification. Mots cles : Angular - FireBase - Angular Material.

# vEnchProject
source: VEnch
ar: فإنش

# vEnchProjectDescription
source: Design of an online platform for real estate auctions. Keywords: HTML - CSS - Bootstrap - JavaScript - PHP.
ar: تصميم منصة عبر الإنترنت لمزادات العقارات. الكلمات الرئيسية: HTML - CSS - Bootstrap - JavaScript - PHP.
fr: Conception d’une plateforme en ligne pour les enchères immobilières. Mots cles : : HTML - CSS - Bootstrap - JAVASCRIPT -PHP.

# myPortfolioProject
source: MyPortfolio
ar: ملفي الشخصي

# myPortfolioProjectDescription
source: Development of a mobile application for my resume. Keywords: Flutter - Dart - l10n.
ar: تطوير تطبيق جوال لسيرتي الذاتية. الكلمات الرئيسية: Flutter - Dart - l10n.
fr: Développement d’une application mobile pour mon CV. Mots cles : : Flutter - Dart - l10n.

# experiences
source: My experiences
ar: تجاربي
fr: Mes experiences

# experience1Name
source: Summer Internship
ar: التدريب الصيفي
fr: Stage d'été

# experience1Description
source: Development and integration of a donation detection application for children using Angular and Django. Keywords: Angular - Django - Bootstrap
ar: تطوير ودمج تطبيق لاكتشاف الهبات للأطفال باستخدام Angular و Django. كلمات مفتاحية: Angular - Django - Bootstrap
fr: Développement et intégration d’une application de détection des dons pour les enfants en utilisation Angular et Django Mots cles : Angular - Django - Bootstrap

# experience1Duration
source: June 2023 - August 2023
ar: يونيو 2023 - أغسطس 2023
fr: juin 2023 - aout 2023

# educations
source: My educations
ar: تعليمي
fr: Mes educations

# educationPost1
source: 2nd year Computer Engineering
ar: السنة الثانية لهندسة الحاسوب
fr: 2ème année génie informatique

# educationInstitute1
source: International Institute of Technology, IIT
ar: المعهد الدولي للتكنولوجيا، IIT
fr: Institut international de technologie, IIT

# educationDuration1
source: 2022 - Present
ar: 2022 - الحاضر
fr: 2022- Présent

# educationPost2
source: Physics and Chemistry Department
ar: قسم الفيزياء والكيمياء
fr: Département physique chimie PC

# educationInstitute2
source: Preparatory Institute for Engineering Studies of Sfax, IPEIS
ar: المعهد التحضيري للدراسات الهندسية بصفاقس، IPEIS
fr: Institut préparatoires aux études d’ingénieurs de Sfax, IPEIS
